# Вариант 2, Зуборевич
books=[{"title": "Боевые роботы Пустоши", "author": "Сергей Зайцев", "year": "2007"},
       {"title": "По ком звонит колокол", "author": "Эрнест Хэмингуэй", "year": "1940"},
       {"title": "Дикая охота короля Стаха", "author": "Владимир Короткевич", "year":""},
       {"title": "Основной рубеж", "author": "Алекс Орлов", "year": "1999"},
       {"title": "Черный замок Ольшанский", "author": "Владимир Короткевич", "year": "1978"}]
for i in range(0, len(books)):
    print(" ---------------------- Книга 1 -----------------------")
    print("Название:", books[i].get("title"), "| Автор:", books[i].get("author"))
    print(" ---------------------- ", books[i].get("year"), "-----------------------")
